### Report for email-and-alerting on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.74"...
- Installing hashicorp/aws v3.76.1...
- Installed hashicorp/aws v3.76.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (5 to add, 7 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ses_to_s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ses_to_s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-inbox-storage-dev/*",
            ]
          + sid       = "AllowSESPuts"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "343515223843",
                ]
              + variable = "aws:SourceAccount"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "arn:aws:ses:eu-west-2:343515223843:receipt-rule-set/gp2gp-inbox-rules-dev:receipt-rule/*",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_log_group.store_asid_lookup will be created
  + resource "aws_cloudwatch_log_group" "store_asid_lookup" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/dev_store_asid_lookup_lambda"
      + retention_in_days = 60
      + tags_all          = (known after apply)
    }

  # aws_iam_policy.store_asid_lookup_lambda_policy will be created
  + resource "aws_iam_policy" "store_asid_lookup_lambda_policy" {
      + arn         = (known after apply)
      + description = "IAM policy for Store ASID Lookup Lambda"
      + id          = (known after apply)
      + name        = "dev-store-asid-lookup-lambda-policy"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.store_asid_lookup_lambda will be created
  + resource "aws_iam_role" "store_asid_lookup_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-store-asid-lookup-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.store_asid_lookup_lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "store_asid_lookup_lambda_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-store-asid-lookup-lambda-role"
    }

  # aws_lambda_function.email_report_lambda will be updated in-place
  ~ resource "aws_lambda_function" "email_report_lambda" {
        id                             = "dev-email-report-lambda"
      ~ last_modified                  = "2025-05-14T10:43:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "R1xouzbWJKJJ5YxnKAhgYds71dE143AK6AbXCXmB/v8=" -> "3hNyG7ZVB/v47OfO2ITojx3ZHzDptkygUANLi9nmmvA="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp2gp-data-pipeline-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-email-report-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.gp2gp_dashboard_alert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "gp2gp_dashboard_alert_lambda" {
        id                             = "dev-gp2gp-dashboard-alert-lambda"
      ~ last_modified                  = "2025-05-14T10:43:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "fc6d8KE+XEfoRDVXsLuwZl/3IPCw9ydg7fzpqRM8fjc=" -> "XbWHnQ36hoJbl3A9xopRw1ovpXxS7NmvP+1N7w6SLw8="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp2gp-data-pipeline-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-gp2gp-dashboard-alert-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.log_alerts_pipeline_error_lambda will be updated in-place
  ~ resource "aws_lambda_function" "log_alerts_pipeline_error_lambda" {
        id                             = "dev-log-alerts-pipeline-error-lambda"
      ~ last_modified                  = "2025-05-14T10:43:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "dgPj5XZ/ivU6UuF94SV+mnY5oAKz4YTdMACeayJYq5g=" -> "H6Raconuln45zbgENXBYqfjiESJ4pNdvw+trF3UV744="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp2gp-data-pipeline-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-log-alerts-pipeline-error-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.log_alerts_technical_failures_above_threshold_lambda will be updated in-place
  ~ resource "aws_lambda_function" "log_alerts_technical_failures_above_threshold_lambda" {
        id                             = "dev-log-alerts-technical-failures-above-threshold-lambda"
      ~ last_modified                  = "2025-05-14T10:43:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "k5MmQecU30eb6Qqona0WwaZiRoQBPWQdm5Rt4uMBxJg=" -> "M0gYYxJOwubcX9qphyzfvtOyPIfRufU10lf49L+xn0A="
        tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp2gp-data-pipeline-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-log-alerts-technical-failures-above-threshold-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.store_asid_lookup will be created
  + resource "aws_lambda_function" "store_asid_lookup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/home/runner/work/prm-gp2gp-data-pipeline-infra/prm-gp2gp-data-pipeline-infra/lambda/build/store-asid-lookup.zip"
      + function_name                  = "dev_store_asid_lookup_lambda"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "ypmEoS0zyEbvPn2EHquE7/ZzNqb94/t33+K3a6q4cmM="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT" = "dev"
            }
        }

      + tracing_config (known after apply)
    }

  # aws_s3_bucket.gp2gp_inbox_storage will be updated in-place
  ~ resource "aws_s3_bucket" "gp2gp_inbox_storage" {
      + acl                         = "private"
        id                          = "prm-gp2gp-inbox-storage-dev"
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "343515223843"
                            }
                          - StringLike   = {
                              - "aws:SourceArn" = "arn:aws:ses:eu-west-2:343515223843:receipt-rule-set/gp2gp-inbox-rules-dev:receipt-rule/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ses.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::prm-gp2gp-inbox-storage-dev/*"
                      - Sid       = "AllowSESPuts"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
        tags                        = {
            "ApplicationRole"     = "AwsS3Bucket"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
            "CreatedBy"           = "prm-gp2gp-data-pipeline-infra"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "prm-gp2gp-inbox-storage-dev"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.gp2gp_inbox_storage will be updated in-place
  ~ resource "aws_s3_bucket_policy" "gp2gp_inbox_storage" {
        id     = "prm-gp2gp-inbox-storage-dev"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "343515223843"
                            }
                          - StringLike   = {
                              - "aws:SourceArn" = "arn:aws:ses:eu-west-2:343515223843:receipt-rule-set/gp2gp-inbox-rules-dev:receipt-rule/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ses.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::prm-gp2gp-inbox-storage-dev/*"
                      - Sid       = "AllowSESPuts"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_ses_receipt_rule.asid_lookup will be updated in-place
  ~ resource "aws_ses_receipt_rule" "asid_lookup" {
        id            = "store-asid-lookup-in-s3-dev"
        name          = "store-asid-lookup-in-s3-dev"
        # (6 unchanged attributes hidden)

      + lambda_action {
          + function_arn    = (known after apply)
          + invocation_type = "Event"
          + position        = 2
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 7 to change, 0 to destroy.

Changes to Outputs:
  + gp2gp_inbox_storage_bucket_arn = "arn:aws:s3:::prm-gp2gp-inbox-storage-dev"

```

</details>